Repository: yamato/perl6doc-jp
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Expressions inside the signature are parsed as parameter declarations rather than ordinary expressions.
ja: シグネチャーの中の式は普通の式よりもパラメータ宣言としてパースされます。

source: Extracting data
ja: データを抜き出す

source: Failing to pass something that matches this constraint will cause the call to fail:
ja: 渡した何かが制約のマッチに失敗すると呼び出しに失敗します：

source: Finally $o.^methods(:local) produces a list of methods that can be called on $o.
ja: 最後に$o.^methods(:local)は$oで呼び出すことができるメソッドのリストを生成します。

source: Finally, the , operator constructs a Parcel, which is a sequence of objects.
ja: 最後に、,演算子はParcelを構築します。それは連続したオブジェクトです。

source: Finally, the perform method call recursively calls the perform method on the various other dependencies in order, giving the output:
ja: 最後にperformメソッドはperformメソッドを様々な従属オーダーに対して呼び出し、出力を得ます：

source: Finally, the method sets the $!done attribute to True, so that subsequent invocations of perform on this object (if this Task is a dependency of another Task, for example) will not repeat the task.
ja: 最後にメソッドは$!done属性にTrueをセットします。そのためこのオブジェクトの以降のperformの実行（例えばもしこのTaskが他のTaskの依存だったら)は仕事を繰り返しません。

source: Finally, this list gets stored in the array @names.
ja: 最後に、このリストは配列@namesに格納されます。

source: Finally, to pass an existing Pair object to a subroutine by position, not name, either put it in parentheses (like (:$thing)), or use the => operator with a quoted string on the left-hand side: "thing" => $thing.
ja: 最後に、存在するPairオブジェクトを名前ではなく位置で渡すために、それを括弧の中に置くか（(:$thing)のように）、=>演算子をクオートされた文字列で左側に置きます："thing" => $thing

source: First, declaring this routine as a method adds it to the list of methods for the current class.
ja: 1番目に、このルーチンをメソッドと宣言することは、現在のクラスのためにそれをメソッドのリストに追加します。

source: First, it checks if the task has already completed by checking the $!done attribute.
ja: 最初に、それは仕事がすでに終わっているか$!done属性を調べて確認します。

source: First, it declares the arguments which callers may or must pass to the subroutine.
ja: 1つ目に、呼び出し元がサブルーチンに渡すことができる、または渡さなければならない引数を宣言します。

source: First, the subroutine declarator sub indicates that you are starting a subroutine declaration.
ja: 最初に、サブルーチン宣言subはあなたがサブルーチン宣言を始めていることを示します。

source: First-class subroutines can help you solve complex problems.
ja: ファーストクラスサブルーチンは複雑な問題を解決するのに役立ちます。

source: For Perl 6 we have to make this preference for lexotic behavior explicit.)
ja: Perl 6ではこの優先傾向を明示的なレギゾチックな振る舞いのために作る必要がある。）

source: For a container, however, use of a coercion type as the of coerces upon setting rather than returning the value.
ja: コンテナについては、ofとしての型の強制の使用は値を返すよりもセットする方に強制されます。

source: For a normal sub or method call, the dispatcher invokes the first candidate which passes any additional constraint checks.
ja: 通常のサブまたはメソッド呼び出しのために、ディスパッチャーはさらなる制約チェックを渡す最初の候補を起動します。

source: For all builtin operations, all Str positions are reported as position objects, not integers.
ja: 全ての組み込み演算のために、全てのStrの位置は整数ではなく位置オブジェクトとして報告されます。

source: For any statement, prefixing with a do allows you to return the value of that statement and use it in an expression:
ja: どんな文でも、doを前につけるとその値を返し、式として使えるようになる：

source: For each combination of chosen symbols for which Player One wins there's a candidate of the form:
ja: 選ばれたPlayer Oneが勝つシンボルの組合せごとに候補の形式があります：

source: For each item, the program uses the printf built-in function to print both the name of the player and a bar.
ja: それぞれのアイテムでプログラムはprintf組み込み関数を使い、プレーヤーの名前とバーを出力します。

source: For each matching rule, the grammar engine calls an action method to populate the ast slot of the match object.
ja: 各々のマッチングルールで、グラマーエンジンはマッチオブジェクトのastスロットにデータを読み込むためにアクションメソッドを呼びます。

source: For example, 'a' lt 'b' is true, and likewise 'a' lt 'aa'.
ja: 例えば、'a' lt 'b'は真、'a' lt 'aa'も同じです。

source: For example, $a + $b will convert a copy of both $a and $b to numbers (unless they are numbers already).
ja: たとえば、$a + $bは$aと$bのコピーを（それらが既に数でない限り）数に変換します。

source: For example, 180.sin(Degrees) is approximately 0.
ja: 例えば180.sin(Degrees)はおよそ0です。

source: For example, ~ (tilde) is the string concatenation operator; to append some text to the end of a string, you can write $string ~= "text", which is equivalent to $string = $string ~ "text".
ja: 例えば、~（チルダ）は文字列連結演算子です：何かのテキストを文字列の終わりに追加するために、$string ~= "text"と書くことができます。これは$string = $string ~ "text"と同等です。

source: For example, Perl forces generic eq to coerce to string comparison, like this:
ja: 例えば、Perlはジェネリックなeqを文字列の比較に強制する。以下のように：

source: For example, a subroutine that performs numeric calculations on its parameters could require that its arguments are of the type Numeric:
ja: 例えば、パラメータで数値計算を実行するサブルーチンはNumeric型の引数を必要とするはずです：

source: For example, if the caller passes two arrays, they would flatten into @pos.
ja: 例えば、呼び出し元が2つの配列を渡したらそれらは@posにフラット化されるでしょう。

source: For example, in:
ja: 例えば：

source: For example, it is possible to accept arguments in a certain range by writing:
ja: 例えば、次のように書くことで引数が特定のレンジを受け入れるようにすることが可能です：

source: For example, regex matches have both positional and named matches--Match objects themselves are a type of capture.
ja: 例えば、正規表現は位置と名前付き両方にマッチします ― Matchオブジェクト自身はキャプチャー型です。

source: For example, the @ sigil checks that the object passed does the Positional role (a role which includes types like Array and List).
ja: 例えば、@シギルはオブジェクトがPositionalロール（ArrayやListのような型を含むロール）をするかチェックします。

source: For example, the following Perl 5 code:
ja: 例えば次のPerl 5コード：

source: For example, to make a little ASCII art dancing figure, you could build up a hash where the keys are names of the dance moves, and the values are anonymous subroutines.
ja: たとえば、ちょっとしたアスキーアート・ダンス・フィギュアを製作するために、あなたはキーがダンスの動作の名前であるハッシュを構築することができます。そして、値は匿名のサブルーチンです。

source: For example, types such as Int and Str refer to the type object of one of the Perl 6 built- in classes.
ja: 例えばIntとStrのような型はPerl 6の組み込みクラスの一つの型オブジェクトを参照します。

source: For example, when populating a hash:
ja: 例えば、ハッシュにデータを読み込むとき：

source: For example, you can parse HTML very badly (footnote: Using a proper stateful parser is always more accurate.) with the code:
ja: たとえば、あなたは非常にひどくHTMLを解析することができます（脚注：適切なステートフル構文解析器を使うことは、常により正確です。）次のコードで：

source: For example, you could build a web form generator that knew how to get input from a user, validate it, and then call a routine with it based upon the information obtained through introspection.
ja: たとえば、あなたは、ユーザーからの入力を得る方法を知っているウェブフォームジェネレーターを構築することができて、それを確認して、そして、イントロスペクションから得られる情報をベースにしてルーチンを呼びます。

source: For example:
ja: 例えば：

source: For finer-grained control of which iterations return values, use gather and take.
ja: 値を返す反復のきめ細かな制御のために、gatherとtakeを使え。

source: For immutable objects (footnote: Objects whose values can not be changed; literal values.
ja: 不変のオブジェクト（値が変化できないオブジェクト；リテラル値。

source: For instance, $x.abs implies conversion to an appropriate numeric type if $x is "cool" but doesn't already support a method of that name.
ja: 例えば、もし$xが“cool”だが既にその名前のメソッドをサポートしない場合、$x.absは適切な数値型への変換を意味します。

source: For instance, next with a label will prefer to exit a loop lexotically, but if there is no loop with an appropriate label in the lexical context, it will then scan upward dynamically through the call frames for any loop with the appropriate label, even though that loop will not be lexically visible.
ja: 例えばラベルと一緒のnextはレギゾチックにループを抜ける方を好む。しかしループのないレキシカルコンテキストでラベルが割り当てられているなら、それはコールフレームを通ってラベルの割り当てられたどんなループでも動的に上方へスキャンするだろう。しかしながらループはレキシカルな可視ではないだろう。

source: For instance, JSON::Tiny::Grammar.parse($tester, :rule<object>) will start parsing at the regex named object ).
ja: 例えば、JSON::Tiny::Grammar.parse($tester, :rule<object>)はobjectという名前の正規表現でパースを始めるでしょう）。

source: For instance, a return statement always returns from the lexically scoped subroutine that surrounds it.
ja: 例えばreturn文は常にそれを囲むレキシカルスコープなサブルーチンから戻ってくる。

source: For instance, a CHECK block is called at the end of compiling a compilation unit.
ja: 例えば、CHECKブロックはコンパイル単位をコンパイルする終端で呼ばれる。

source: For instance, the literal 7 will always and forever be just a 7.), this is an ordinary value comparison.
ja: 例えば、リテラルの7は常に、いつまでも7です。）これは普通の値比較です。

source: For instance, there is a rule to match alphabetic characters (<alpha>), and another to match digits (<digit>), and another to match whitespace (<ws>), etc.
ja: たとえば、英字（<alpha>）、数字（<digit>）、空白（<ws>）にマッチするルールなどです。

source: For instance, unlike normal lexically scope variables, dynamic variables search up the dynamic call stack for a variable of a particular name, but at each "stop" along the way, they are actually looking in the lexical "pad" associated with that particular dynamic scope's call frame.
ja: 例えば通常のレキシカルなスコープの変数と違い、ダイナミックな変数は特定の名前の変数のためにダイナミックコールスタックをそれぞれの「ストップ」まで道々探すけれども、実際は特定のダイナミックスコープのコールフレームに関連付けられたレキシカル「パッド」を見ている。

source: For more information on roles see link.
ja: ロールの詳細についてはリンクを見てください。

source: For mutable objects, === compares their identities.
ja: 可変のオブジェクトでは、===はそれらの同一性を比較します。

source: For numbers, the comparison operator is <=> and for strings it's leg (from lesser, equal, greater).
ja: 数値のための比較演算子は<=>です。そして文字列ではlegです（lesser、equal、greaterから来ています）。

source: For optimal re-use, classes should be small, but in order to represent a complex entity with many behaviors, classes tend to grow large.
ja: 最適な再利用のためにクラスは小さいべきです。しかし、多くの振る舞いで複雑な実体を表すために、クラスは大きくなる傾向があります。

source: For plotting the names of the players and bar charts, the program needs to know how much space to allocate for the player names.
ja: プレーヤーと棒グラフの名前をプロットするために、プログラムはどれくらいのスペースをプレーヤー名に割り当てるべきか知っている必要があります。

source: For safety, perform your compositions at compile time.
ja: 安全のために、コンパイル時であなたの合成を実行してください。

source: For the lexotic return of next, the control exception will contain the identity of the loop scope to be exited (since the label was already "used up" to discover that identity), but for the dynamic fallback, the exception will contain only the loop label to be matched dynamically.
ja: レギゾチックなリターンのnextでは、制御例外は終了されるループスコープの識別子を含んでいるだろう。しかしダイナミックなフォールバックでは、その例外は動的にマッチされるループラベルだけが含まれているだろう。

source: For this reason, rationals with large denominators automatically degrade to Num.
ja: この理由から、大きな分母による有理数は、Numに自動的にデグレードします。

source: Format of this book
ja: この本の形式

source: Frequent users of the UNIX shells might have noticed a symmetry between postional and named arguments to routines on the one hand, and argument and options on the command line on the other hand.
ja: UNIXシェルの常習的なユーザーは、コマンドライン引数と、ルーチンの引数とオプションに対する前後関係に依存して名をつけられた引数の間で、対称性があることに気がついたかもしれません。

source: From the output of this program, you can observe that doing the YMCA dance in ASCII art looks just as bad as in real life.
ja: このプログラムの出力から、アスキーアートの中でYMCAダンスをしているのに気づくことができます。

source: From there it continues to scan outward to find the innermost block outside the when that defines $_, either explicitly or implicitly.
ja: そこからそれは$_を定義するwhenの外側の最も深いブロックを探すために外側にスキャンを続ける。明示的か暗黙的に。

source: From this point on, $self now has all of the methods from the role, in addition to all of the ones that it had before.
ja: 今後、それが前に持っていたもののすべてに加えて、$selfは現在ロールからのメソッドのすべてを持っています。

source: Further call frames up the caller stack may be located by use of the callframe function:
ja: 呼び出し元のスタックより上のコールフレームはcallframe関数の使用によって配置することもできる：

source: Further compounding the difficulty is that every dynamic scope's outer call frame is associated with a lexical scope somewhere, so you can't just consider one kind of scoping or the other in isolation.
ja: それ以上に難しさをより一層ひどくするのは、それぞれのダイナミックスコープの外側のコールフレームがレキシカルスコープの何処かに関連付けられていることだ。そういう訳で、あなたは一種類のスコープどちらかだけを分離して考えることはできない。

source: Furthermore, constructors are ordinary methods.
ja: さらにまた、コンストラクタは普通のメソッドです。

source: Furthermore, the type declaration on this attribute indicates that the array may only hold instances of the Task class (or some subclass of it).
ja: さらにまた、この属性の上の型宣言は、配列がTaskクラス（またはそれの若干のサブクラス）のインスタンスをだけを持つことを示します。

source: Generally you don't need to worry about this unless you're defining a control construct.
ja: 一般に、あなたが制御構造を定義するのでなければこれに関して心配する必要はない。

source: Generic types
ja: ジェネリック型

source: Given sink, there's no need for an "else" clause on Perl 6's loops, and the sink construct works in any list, not just for loops.
ja: sinkがあればPerl 6のループで“else”節は必要なく、sink構造はforループだけでなくどんなリストでも動作します。

source: Given an object $p, and the class definitions from the previous sections, we can ask it a few questions:
ja: オブジェクト$pと前のセクションからのクラス定義を与えられたとすると、我々はそれに少しの質問を尋ねることができます：

source: Given two types A and B, where A conforms to B (A ~~ B, in Perl 6 code), an object which conforms to A does so more narrowly than to B.
ja: 2つの型AとBがあれば、AがB（Perl 6コードでA ~~ B）に適合する所でAに適合するオブジェクトはBにより間近でそうします。

source: Good idea, but Positive Integer would be a subset type, which doesn't count as a narrower nominal type.
ja: 良い考えはPositive Integer以外のサブセット型です。そしてそれはより狭い名目型とされません。

source: Good luck and--as the Perl 6 community often says--have fun!
ja: 幸運を祈ります。そして ― Perl 6コミュニティがよく言うように ― 楽しんでください！

source: Grammar Inheritance
ja: グラマーの継承

source: Grammars
ja: グラマー

source: Grammars organize regexes, just like classes organize methods.
ja: クラスがメソッドを編成するように、グラマーは正規表現を編成します。

source: Handled exceptions break out past this implicit rethrow.) Hence, CATCH is unlike all other switch statements in that it treats code inside a default block differently from code that's after all the when blocks but not in a default block.
ja: 扱われる例外は暗黙の再スローを過ぎて抜けだす。）その後、CATCHは他のすべてのswitch文と違ってdefaultブロック内のコードを違うように扱う。結局whenブロックでdefaultブロックではない。

source: Hashes within curly braces are interpolated as a series of lines.
ja: ブレースの中のハッシュは、一連の行として差し込まれます。

source: Hence numeric coercions such as +"42foo" can be forced to return 42 after issuing a warning.
ja: その後、+"42foo"のような数値強制は警告を出す後に42を返すように強要できる。 after issuing a warning.

source: Hence these declare the same variables with the same scope as the preceding example, but run the statements as a whole at the indicated time:
ja: その後、それらはすぐ前の例と同じスコープと同じ値を宣言する。しかし示された時に全体として文を実行する：

source: Hence, the leave function:
ja: それゆえに、leave関数は：

source: Here \w+ matches a word, and [\w+]+ % [\,\s*] matches at least one word, where several words are separated by a comma and an arbitrary amount of whitespace.
ja: ここでは\w+はワードにマッチします。そして[\w+]+ % [\,\s*]は少なくとも1つのワードにマッチします。いくつかのワードはコンマと任意の数の空白文字で区切られます。

source: Here the multi dispatcher selects the routine based on the value of the first argument.
ja: ここでは、マルチディスパッチャーは最初の引数の値に基づくルーチンを選びます。

source: Here you can find an implementation that turns Perl 6 data structures to JSON.
ja: ここであなたは、Perl 6データ構造をJSONに作り出す実装を見つけることができます。

source: Here's one way to solve that problem in Perl 6:
ja: Perl 6でその問題を解決する1つの方法はこうなります：

source: Here, the @tasks array will end up containing two Captures, each of which contains two positional arguments and one named argument.
ja: ここで、@tasks配列は2つのCaptureを含んで終わり、それぞれは2つの位置引数と1つの名前付き引数を含んでいます。

source: Hierarchical types
ja: 階層型

source: Hint: %hash.keys returns a list of all keys stored in %hash.
ja: ヒント：%hash.keysは%hashに保存されている全てのキーのリストを返します。

source: How can you change the program if the first input line is omitted?
ja: 最初の入力行が省略されるならば、あなたはどのようにプログラムを変えますか？

source: How can you maintain a variable list of custom behaviors, allow user input, and restrict that input to a safe set of behaviors?
ja: あなたはどのようにしてカスタマイズした振る舞いのリストを保守し、ユーザーの入力を可能にし、入力を安全な振る舞いのセットに制限しますか？

source: How would you modify your program to achieve that?
ja: それを達成するために、あなたはプログラムをどのように修正するでしょうか？

source: However T is a constraint for the second parameter which accounts for as many steps of narrowness as the number of inheritance steps between T and Any.
ja: しかしTは、TとAnyの間の継承ステップの数と同じくらい多くの狭さのステップの原因である第二パラメータのための制約です。

source: However Ana and Dave have both won two matches.
ja: しかしAnaとDaveは両方とも2試合勝ちました。

source: However only positional parameters contribute to the narrowness of a match:
ja: しかし位置依存のパラメータだけは、マッチの狭さに寄与します：

source: However, JSON::Tiny::Grammar only implicitly matches whitespace through the use of rules.
ja: しかし、JSON::Tiny::Grammarはルールを用いて空白に暗黙のうちにマッチするだけです。

source: However, a take function that is not in sink context gathers its return objects en passant and also returns them unchanged.
ja: しかしながら、sinkコンテキストでないtake関数はリターンオブジェクトをついでに集め、そしてそれらを不変で返す。

source: However, a CATCH must not behave that way, so we say that a CATCH block never attempts to handle any exception thrown within its own dynamic scope.
ja: しかしながら、CATCHはそのように振舞ってはならない。それゆえ、CATCHブロックは決して独自のダイナミックスコープの範囲内で投げられた何か一つの例外をハンドルしようとしないといえる。

source: However, a matching constraint always contributes less to narrowness than a more specific match in the nominal type.
ja: しかしマッチする制約は常に名目型で、狭さより特定のマッチに貢献します。

source: However, a role cannot stand on its own; you cannot instantiate a role.
ja: しかしロールは単独では有効でありません；あなたは、ロールをインスタンス化することができません。

source: However, a type object responds to the function call interface, so you may use the name of a type with parentheses as if it were a function, and any argument supplied to the call is coerced to the type indicated by the type object.
ja: しかし型オブジェクトは関数呼び出しインターフェースに応答するので型の名前を括弧で関数であるかのように使用でき、呼び出しに供給された引数は型オブジェクトで示された型に強制されます。

source: However, binding Nil to a parameter (::= semantics) works more like assignment; passing Nil to a parameter with a default causes that parameter to be set to its default value rather than an undefined value, as if the argument had not been supplied.
ja: しかし、Nilをパラメーターにバインドすることは（::=セマンティクス）より割り当てに近いです；Nilをデフォルトでパラメータに渡すと、それは未定義値よりもデフォルト値をセットします。まるで引数が供給されなかったように。

source: However, in some cases it is useful to do so, and therefore Perl allows you to manipulate captures directly.
ja: しかしながら、いくつかのケースでそうすることは役に立ちます。ゆえにPerlはキャプチャーを直接操作することを可能にしています。

source: However, in that case &foo by itself is not sufficient to uniquely name a specific function.
ja: しかし、その場合&foo自身は特定の関数にユニークに名前を付けるのに十分ではありません。

source: However, in this case it is specifying the full set of arguments for the call, including both named and positional arguments.
ja: しかし、この場合それは呼び出しのための引数のフルセット、名前付きと位置引数を含んでいることを示しています。

source: However, it is immediately consumed by the call.
ja: しかし、それは呼び出しによって直ちに消費されます。

source: However, it may allow the compiler to perform certain optimizations depending on which Perl 6 implementation you are using.
ja: しかし、それはあなたが使用しているPerl 6の実装に依存してコンパイラが特定の最適化を行うのを可能にするかもしれません。

source: However, it's not an error when prefixed by a do, or when followed by a statement modifier:
ja: けれども、doによって前に付けられる時、または文修飾子が続く時はエラーではない：

source: However, named parameters have no such restriction.
ja: しかし、名前付きパラメータにそのような制限はありません。

source: However, recursive calls to the same clone use the same state variable.
ja: しかしながら、同一のクローンの再帰的呼び出しは同じstate変数を使う。

source: However, that's likely to be visually confused with a following while loop at the best of times, so it's also allowed to put the loop conditional at the front, with the same meaning.
ja: しかしながら、whileループが続くのは多分視覚的にわかりにくいので、同じ意味でループ条件を前に置くことができる。

source: However, the default sort on an array sorts by its contents.
ja: しかし、配列でのデフォルトのソートはその内容によって並べ替えます。

source: However, the example code does not seem to have a regex named TOP; it has a rule named TOP.
ja: しかし、コード例はTOPという名前の正規表現を持っていないようです；それはTOPという名前のルールを持っています。

source: However, the labeled forms can use method call syntax: LABEL.next, etc.
ja: しかし、ラベル付きの形式はメソッド呼び出し文法を使用出来る：LABEL.nextなど。

source: However, the name is introduced into the scope of the declaration itself, so it may be used to call itself recursively:
ja: しかし名前は宣言自体に導入されているので、自分自身を再帰的に呼び出すのに使えます：

source: However, the new semantics of autothrowing when sink eats a Failure means we won't have many unthrown exceptions waiting around to be handled at the end of the block anymore.
ja: しかしながら、sinkがFailureを食べるときの自動スローの新しいセマンティクスは我々がたくさんのブロックの終端で待つハンドルされるスローされない例外を持ちたくないことを意味する。

source: However, there are two important differences.
ja: しかし2つの重要な違いがあります。

source: However, there have to be some culturally enforced standards on which constructs capture which exceptions.
ja: けれども、構造がその例外を捕らえるいくつかの文化的に強要された標準がある必要がある。

source: However, there may be race conditions in the case of diamond dependencies, wherein Tasks A starts B and C in parallel, and both start a copy of D, making D run twice.
ja: しかし、ダイアモンド従属物で競合状態がある場合にTask Aは BとCを平行に開始し、そして両方がDのコピーを開始してDを2度実行させます。

source: However, they only scratch the surface of what's possible.
ja: しかし、それらは可能であるものの表面をひっかくだけです。

source: However, this attribute represents an array of items, so it requires the @ sigil.
ja: しかし、この属性は配列のアイテムを表すので、@シギルを必要とします。

source: However, this does not mean that Perl 5 is going away.
ja: しかし、これはPerl 5が無くなるという意味ではありません。

source: However, this is likely to fail on autochomped filehandles, so use the for loop instead.
ja: しかしながら、これは自動でchompされたファイルハンドルではおそらく失敗するので、代わりにforループを使え。

source: However, use of $_ with a conditional or conditionally repeating statement's block is not considered sufficiently explicit to turn a 0-ary block into a 1-ary function, so all these methods use the same invocant:
ja: しかしながら、0のブロックを1の関数に変えるために$_を条件付きまたは条件付きで繰り返すブロックで使うことは十分に明白とは見なされない。だから全てのこれらのメソッドは同じインボカントを使う：

source: However, you can explicitly specify that a parameter is required by appending a ! to it:
ja: しかし!を付け加えることでパラメータが必要であることを明示することができます：

source: However, you may omit the parentheses on the conditional:
ja: けれども、括弧は条件付きで省略できる：

source: I could use a table or figure here to illustrate the hierarchy of narrowing.
ja: 私は狭くなる階層を例示するために、テーブルまたはフィギュアをここで使うことができました。

source: I have the temptation to write "And this is a great way to implement the guts of a compiler, as Perl 6 itself does!"
ja: 私は「これはPerl 6自身がするようにコンパイラの中身を実装する素晴らしい方法だ！」と書く誘惑に駆られます。

source: I've explained this as a form of context in the Modern Perl book; it may work here too.
ja: 私はModern Perl本のコンテキストの形式としてこれを説明しました；それはここでも働きます。

source: I've tried to clarify.
ja: 分かりやすくなるように努力しました。

source: If $r1 has a larger value than $r2, %matches{$p1} increments by one.
ja: $r1が$r2よりも大きな値を持つならば、%matches{$p1} は1インクリメントします。

source: If $r1 is not larger than $r2, %matches{$p2} increments.
ja: $r1が$r2よりも小さいならば、%matches{$p2}をインクリメントします。

source: If $label-area-width is 8, the format string is "%- 8s%s\n", which means a string ('s') filled to 8 spaces (' 8') and left-justified ('-'), followed by another string and a newline.
ja: もし$label-area-widthが8なら、書式文字列は"%- 8s%s\n"になります。それは文字列（'s'）が8スペース（' 8'）で左揃え（'-'）、他の文字列と改行が続くという意味です。

source: If a method does exist, the grammar engine passes the current match object as a positional argument.
ja: メソッドが存在するならば、グラマーエンジンは現在のマッチオブジェクトを位置依存の引数として渡します。

source: If a quantifier has several ways to match, Perl will choose the longest one.
ja: 数量詞がマッチするいくつかの方法を持っているならば、Perlは最も長いものを選ぶでしょう。

source: If a set of regexes were to call each other recursively without progressing in the string, the recursion could go on infinitely and never proceed to other parts of the grammar.
ja: 一組の正規表現が文字列を進行することなく互いに再帰的な呼び出しであるならば、再帰は無限に続くことができて、グラマーの他の部分まで決して進行することができません。

source: If an option does not require a parameter, the parameter in the MAIN signature needs to be marked as being of Bool type.
ja: オプションがパラメータを必要としないならば、MAINシグネチャーのパラメータはBool型であるとマークされる必要があります。

source: If any arguments are supplied to the succeed function, they are passed out via the leave method.
ja: 何か一つの引数がsucceed関数に与えられたら、それらはleaveメソッド経由で渡される。

source: If any exceptions are returned as not handled, the exception thrower keeps looking for a higher dynamic scope for a spot to unwind to.
ja: もし何か一つの例外がハンドルされないとして返されるなら、例外を投げるものはスポットして巻き戻すためにより高いダイナミックスコープを探し続ける。

source: If both players select the same item, it's a draw.
ja: 両方のプレーヤーが同じアイテムを選ぶならば、それはドローです。

source: If continuations are used, the .resume call will simply goto the continuation in question, and the lambda's callframe is abandoned.
ja: もし継続が使われたら、.resume呼び出しは単純に問題の継続に飛び、 そのlambdaのコールフレームは破棄される。

source: If either part is NaN, then the entire number may possibly be NaN.
ja: どちらの部分でもNaNなら、全体の数はおそらくNaNです。
